"""
    画出下列代码内存图
"""
import copy

list01 = [
    ["烤鸭", "豆汁"],
    ["火锅", "兔头"],
    ["麻花", "包子"],
]
list02 = list01  # 赋值 - 由于没有拷贝数据(数据一份),修改拷贝前或后,互相影响
list03 = list01[:]  # 浅拷贝 - 由于只拷贝一层(第一层数据两份),修改第一层互不影响,修改深层互相影响.
list04 = copy.deepcopy(list01)  # 深拷贝- 由于拷贝所有数据(数据两份),修改拷贝前或后,互不影响

list04[0] = ["全聚德", "大董"]
print(list04)
print(list01)

# 通过索引修改,会记录右侧容器地址
list03[0][1] = ["全聚德", "大董"]
print(list03)
print(list01)  # [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]

# # 通过切片修改,会遍历右侧数据,会记录右侧容器中元素
list02[0][:] = ["全聚德", "大董"]
print(list02)
print(list01)  # [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
