"""
    数据基本运算
        数据
            变量：操作数据
            数据类型：字符串str  整数int   小数float
                      "   "     10       10.0
        运算
            算数：+ - * 小数商/  整数商//  余数%  幂运算**
            增强：+=  -=  *=  /=  //=  %=  **=
                a = a + 1
                a += 1
"""
# 整数字面值
# 十进制DEC：每位用十种状态计数，逢十进一，写法是0~9。
number10 = 10
# 二进制BIN：每位用二种状态计数，逢二进一，写法是0~1。
number02 = 0b10
# 八进制OCT：每位用八种状态计数，逢八进一，写法是0~7。
number08 = 0o10
# 十六进制HEX：每位用十六种状态计数，逢十六进一，写法是0~9  a(10)~f(15)。
number16 = 0x10
# 备注：print输出的数字都是十进制
print(number10)
print(number02)  # 2
print(number08)  # 8
print(number16)  # 16
