"""
    复习 - 函数参数
        形式参数:约束实参传递方式
            位置形参:必填
            命名关键字形参:必须用关键字实参
            不定长参数
                星号元组形参:位置实参数量无限
                双星号字典形参:关键字实参数量无限
"""

# 语法:
# 位置形参:def 函数名(形参名1,形参名2):
# 适用性:需要调用者必须传递某些信息(最常用的形参)
def func01(p1, p2, p3):
    pass


# 命名关键字形参:def 函数名(*,参数名):
#              def 函数名(*args,参数名):
# 星号后面的位置形参
# 价值:让实参代码可读性更高
def func02(p1, *, p2=0):
    pass


func02(1, p2=2)


# 星号元组形参:def 函数名(*args):
# 价值:位置实参数量无限
def func03(*args, p1=0):
    pass


func03(1, 2, 3, p1=2)


# 双星号字典形参:def 函数名(**kwargs):
# 价值:关键字实参数量无限
def func04(**kwargs):
    pass


func04(a=1, b=2, c=3)
