"""
    小结 -- 语句
        选择语句：有选择性的执行某些语句
            if 条件:
                语句
            else:
                语句
        循环语句：重复执行某些语句
            满足条件重复执行语句
                while 条件:
                    语句
                例如：纸张对折,直到超过珠穆朗玛峰.
            获取容器中所有元素
                for 变量 in 容器:
                    语句
                例如：累加整数(字符串类型)每位
                备注：数值类型不能参数for
            固定次数循环
                for 变量 in range(开始,结束,间隔):
                    语句
                例如：累加某个范围内的数字

        跳转语句
            在循环中
            break 跳出
            continue 跳过
    练习:exercise09
"""