"""
    小结
        字符串格式化：生成一种格式的字符串
            格式%(变量)

        列表
            列表名 = [元素1,元素2]
            列表名.append(元素)
            定位
                ? = 列表名[整数]   # 读取
                列表名[整数]  = ?  # 修改
                ? = 列表名[开始:结束:间隔]
                列表名[开始:结束:间隔] = ?
            删除
                列表名.remove(元素)
                del 列表名[索引/切片]
            遍历(获取所有元素)
                for item in 列表名:
                    item 存储的是列表中的元素
                for i in range(开始,结束,间隔):
                    i 存储的整数(索引)
"""
